Tekla.Structures.Drawing.Hideable
Accesses the information if this object is hidden or not or if it should be.
This example opens the first available drawing and hides all ModelObject's from the view.
namespace Hideable
{
using Tekla.Structures.Drawing;
public static class Example
{
public static void Example1()
{
DrawingHandler drawingHandler = new DrawingHandler();
DrawingEnumerator drawingList = drawingHandler.GetDrawings();
if(drawingList.MoveNext())
{
Drawing currentDrawing = drawingList.Current;
drawingHandler.SetActiveDrawing(currentDrawing);
DrawingObjectEnumerator objectList = currentDrawing.GetSheet().GetAllObjects(typeof(ModelObject));
while(objectList.MoveNext())
{
ModelObject currentObject = objectList.Current as ModelObject;
if(currentObject != null)
{
if(!currentObject.Hideable.IsHidden) // The object is not yet hidden
{
currentObject.Hideable.HideFromDrawingView();
currentObject.Modify();
}
}
}
}
}
}
}

Tekla.Structures.Drawing.Hideable.IsHidden
Retrieves the information if this object is hidden or not.

Tekla.Structures.Drawing.Hideable.HideFromDrawingView
Hides this object from the drawing view.
Calling Modify on the object is required to hide the object.

Tekla.Structures.Drawing.Hideable.HideFromDrawing
Hides this object from the whole drawing.
Calling Modify on the object is required to hide the object.

Tekla.Structures.Drawing.Hideable.ShowInDrawingView
Shows this object in the drawing view.
Calling Modify on the object is required to show the object.

Tekla.Structures.Drawing.Hideable.ShowInDrawing
Shows this object in the whole drawing.
Calling Modify on the object is required to show the object.